// day03, ex5
#include <format>
#include <iostream>

using std::format;
using std::cout;

int main() {
    int array[] { 1, 2, 3, 4, 5 };
    for(const int& i : array) {
        cout << format("{} ", i);
    }
    cout << '\n';
}
//элементы индексируются начиная с ноля. поэтому если я добавлю:
    /* auto x = array[2];
       cout << format ("x is {}\n", x);
    */

    //то кроме вывода 1 2 3 4 5, внизу получим х is 3. Потому что идекс2 является третьим элементом в нашем массиве.

/* а если я бы сказал, что:

    array[2] = 42;  //то,  x is 42.
    auto x = array[2];
    cout << format ("x is {}\n", x);

*/







//for выводит все элементы массива.
//Ссылка действительно не создаёт копию. i — это другое имя того же элемента массива.
//i поочерёдно ссылается на: array[0], array[1], array[2], ...
// const запрещает менять объект через эту ссылку
//int& — ссылка позволяет обращаться к элементу массива без копирования.const запрещает изменять элемент через эту ссылку, поэтому внутри цикла массив нельзя модифицировать.
//format для вывода каждого элемента в массиве
