// Задание1. Напишите код вывода "Hello, world!" на экран. На лекции мы писали это внутри функции main(), а тут мы должны это написать внутри функции sayHello() для удобства. Директивы #include и фукнции sayHello и main писать не нужно. Нужно только написать код вывода.
// Решение:

#include <iostream>
void say_hello()
{
    std::cout << "Hello, World!" << std::endl;
}
