/*

Минус 10
Дано целое число. Если число больше 100 то вычесть из числа 10. Вывести число на экран.

Пример 1:
Ввод: 65
Вывод: 65

Пример 2:
Ввод: 144
Вывод: 134

Главная идея задачи:
изменять число только если условие выполняется.
*/

#include <iostream>
using namespace std;

void mainx()
{

    int num;
    cin >> num;
    if (num > 100)
    {
        num -= 10;
    }
    cout << num << endl;
}