/*Нечетные
Дано целое число n, вывести все нечетные число до n (не включительно).

Пример 1:
Ввод: 10
Вывод: 1 3 5 7 9

Пример 2:
Ввод: 7
Вывод: 1 3 5*/

#include <iostream>
using namespace std;

void mainx()
{
    int n;

    cout << "Введите число n: ";
    cin >> n;
    for (int i = 1; i < n; i += 2)
    {
        cout << i << " ";
    }
}