/*С шагом X
Даны целые числа n и x, нужно вывести числа от 0 до n (не включительно) с шагом x.

Пример 1:
Ввод: 8 1
Вывод: 0 1 2 3 4 5 6 7

Пример 2:
Ввод: 10 3
Вывод: 0 3 6 9

Пример 3:
Ввод: 7 5
Вывод: 0 5*/

#include <iostream>
using namespace std;

void mainx()
{
    int n, x;
    cin >> n >> x;

    for (int i = 0; i < n; i += x)
    {
        cout << i << " ";
    }
}