/*Сумма
Дано целое число n, вывести сумму чисел от 1 до n включительно.

Пример 1:
Ввод: 5
Вывод: 15
Объяснение: 1 + 2 + 3 + 4 + 5 = 15

Пример 2:
Ввод: 7
Вывод: 28
*/

#include <iostream>
using namespace std;

void mainx()
{
    int n;
    cout << "Введите целое число n: ";
    cin >> n;

    int sum = 0;
    for (int i = 1; i <= n; ++i)
    {
        sum += i; // sum = sum + i
    }

    cout << "Сумма чисел от 1 до " << n << " включительно: " << sum << endl;
}