/*Сумма до X
Даны целые числа n и x, найти сумму чисел от 1 до n включительно так, чтобы сумма не превысило x.

Пример 1:
Ввод: 5 100
Вывод:  15
Объяснение: 1 + 2 + 3 + 4 + 5 = 15 не превышает 100

Пример 2:
Ввод: 100 14
Вывод: 10
Объяснение: 1 + 2 + 3 + 4 = 10 не превышает 14, а уже 1 + 2 + 3 + 4 + 5 = 15 превышает поэтому мы не можем дальше суммировать.

Пример 3:
Ввод: 10 15
Вывод: 15
Объяснение: 1 + 2 + 3 + 4 + 5 = 15 не превышает 15, но 1 + 2 + 3 + 4 + 5 + 6 = 21 превышает поэтому мы не можем дальше суммировать*/

#include <iostream>
using namespace std;

void mainx()
{
    int n, x;
    cin >> n >> x;

    int sum = 0;
    for (int i = 1; i <= n; i++)
    {
        if (sum + i > x)
        {
            break;
        }
        sum += i;
    }

    cout << sum << endl;
}