/*Только нечетные
Даны целые числа a и b, вывести на экран только нечетные числа между a и b включительно.

Пример 1:
Ввод: 5 9
Вывод: 5 7 9

Пример 2:
Ввод: 4 12
Вывод: 5 7 9 11*/

#include <iostream>
using namespace std;

void mainx()
{
    int a, b;
    cin >> a >> b;

    for (int i = a; i <= b; i++)
    {
        if (i % 2 != 0)
        {
            cout << i << " ";
        }
    }
}