/*Только кратные x
Даны целые числа n и x, вывести числа от 1 до n включительно кратные x. То есть числа которые дают остаток 0 при делении на x.

Пример 1:
Ввод: 5 2
Вывод: 2 4

Пример 2:
Ввод: 38 7
Вывод: 7 14 21 28 35*/

#include <iostream>
using namespace std;

void mainx()
{
    int n, x;
    cin >> n >> x;
    for (int i = 1; i <= n; i++)
    {
        if (i % x == 0)
        {
            cout << i << " ";
        }
    }
}