// цилические алгоритмы с использованием массивов

/*
Создать массив с произвольным размером
Дано целое число n, размер массива. А также n целых чисел, элементы массива. Создать массив с данными элементами и вывести на экран.

Пример:
Ввод:
5
4 5 6 1 9
Вывод:
4 5 6 1 9

*/

#include <iostream>
using namespace std;

void mainx()
{
    int n;
    cin >> n;
    int a[n];
    for (int i = 0; i < n; i++)
    {
        cin >> a[i];
    }
    for (int i = 0; i < n; i++)
    {
        cout << a[i] << " ";
    }
}