/*Массив * число
Дано целое число n, размер массива. И n вещественных чисел, элементы массива и еще одно вещественных число x. Умножить x на элементы массива у которых нечетный индекс(номер в массиве). Вывести массив.

Например:
Ввод:
5
4.5 2.88 6.1 5 8.65
6.1
Вывод:
4.5 17.568 6.1 30.5 8.65*/

#include <iostream>
using namespace std;

void mainx()
{
    int n;
    cin >> n;
    double arr[100];
    for (int i = 0; i < n; i++)
    {
        cin >> arr[i];
    }
    double x;
    cin >> x;
    for (int i = 1; i < n; i += 2)
    {
        arr[i] *= x;
    }
    for (int i = 0; i < n; i++)
    {
        cout << arr[i] << " ";
    }
}
