/*
Массив + Массив
Дано целое число n. После этого на вход дается элементы двух массивов с размером n. Создать третий массив каждый элемент которого равен сумме элементов двух массивов на том же индексе. То есть, если данные массивы называются a и b, и новый массив c, то сумма элементов на одном индексе c[i] = a[i] + b[i];

Пример:
Ввод:
5
1 2 3 4 5
7 4 9 4 4
Вывод:
8 6 12 8 9
*/

#include <iostream>
using namespace std;

void mainx()
{
    int n;
    cin >> n;
    int a[n], b[n], c[n];
    for (int i = 0; i < n; i++)
    {
        cin >> a[i];
    }
    for (int i = 0; i < n; i++)
    {
        cin >> b[i];
        c[i] = a[i] + b[i];
    }
    for (int i = 0; i < n; i++)
    {
        cout << c[i] << " ";
    }
}