/*Лестница наоборот
Дано целое число n, вывести все числа от 1 до n, в виде лестницы как в прошлой задаче, только наоборот. То есть первое число n раз, второе n - 1 раз и так далее.

Например:
Ввод: 5
Вывод:
1 1 1 1 1
2 2 2 2
3 3 3
4 4*/

#include <iostream>
using namespace std;

void mainx()
{
    int n;
    cin >> n;
    for (int i = 0; i < n; ++i)
    {
        for (int j = 0; j < n - i; ++j)
        {
            cout << i << " ";
        }
        cout << endl;
    }
}