/*Вывести как в примере
Даны целые числа n и m, вывести на экран числа как в примере. То есть вывести n*m чисел, в каждой строке увеличивать числа на номер строки.

Пример 1:
Ввод:
5 3
Вывод:
0 0 0
0 1 2
0 2 4*/

#include <iostream>
using namespace std;

void mainx()
{
    int n, m;
    cin >> n >> m;
    for (int i = 0; i < n; i++)
    {
        for (int j = 0; j < m; j++)
        {
            cout << i * j << " ";
        }
        cout << endl;
    }
}