/*
Создать двумерный массив
Создай двумерный массив из 4 строк и 2 столбцов, состоящий из элементов {{1, 2}, {-4, 7}, {8, 11}, {9, 0}}. Вывести массив на экран.
*/

#include <iostream>
using namespace std;

void mainx()
{
    int arr[4][2] = {{1, 2}, {-4, 7}, {8, 11}, {9, 0}};
    for (int i = 0; i < 4; i++)
    {
        for (int j = 0; j < 2; j++)
        {
            cout << arr[i][j] << " ";
        }
        cout << endl;
    }
}