/*
Создай массив произвольного размера. Часть 1
Даны целые числа n и m, создать двумерный массив из n строк и m столбцов, заполнить массив единичками и вывести на экран.

Пример:
Ввод: 4 3
Вывод:
1 1 1
1 1 1
1 1 1
1 1 1

#include <iostream>
using namespace std;

int mainx()
{
    int n, m;
    cin >> n >> m;

    int arr[n][m]; // Создаем двумерный массив из n строк и m столбцов

    // Заполняем массив единичками

    for (int i = 0; i < n; i++)
    {
        for (int j = 0; j < m; j++)
        {
            arr[i][j] = 1;
        }
    }

    // Выводим массив на экран

    for (int i = 0; i < n; i++)
    {
        for (int j = 0; j < m; j++)
        {
            cout << arr[i][j] << " ";
        }
        cout << endl;
    }
}

*/

/*Создай массив произвольного размера. Часть 2
Даны целые числа n и m размер двумерного массива, также n * m чисел элементы массива. Вывести массив на экран.

Пример:
Ввод:
4 3
1 2 3
9 5 4
7 2 0
-1 -1 5
Вывод:
1 2 3
9 5 4
7 2 0
-1 -1 5
*/

#include <iostream>
using namespace std;

int mainx()
{
    int n, m;
    cin >> n >> m;

    int arr[n][m];

    for (int i = 0; i < n; i++)
    {
        for (int j = 0; j < m; j++)
        {
            cin >> arr[i][j];
        }
    }

    for (int i = 0; i < n; i++)
    {
        for (int j = 0; j < m; j++)
        {
            cout << arr[i][j] << " ";
        }
        cout << endl;
    }
}