// Даны два целых числа на вход. Вывести сумму.

#include <iostream>
using namespace std;

void sum()
{
    int a, b;
    cin >> a >> b;
    cout << a + b << endl;
}