/*
Создать функцию
Напишите функцию getHello() которая возвращает строку "Hello"

#include <string>
using namespace std;

string getHello() {
    return "Hello";
}


*/
/*
Создать функцию 2
Напишите функцию myfunction() которая выводит на экран строку "My function" и возвращает число 0.
*/

#include <iostream>
using namespace std;

int myfunction()
{
    cout << "My function" << endl;
    return 0;
}
