// передача параметров функции по ссылке и по значению

/*
Инкремент
Напишите функцию increment которая принимает целое число по ссылке и увеличивает число на 1. Функция ничего не возвращает.


void increment(int &n)
{
    n++;
}

*/

/*Напишите функцию print которая принимает строку по значению и выводит ее на экран.

#include <iostream>
#include <string>

void print(const std::string s)
{
    std::cout << s << std::endl;
}


*/
/*Функция sum
Напишите функцию sum, которая принимает два целых числа и возвращает сумму этих двух чисел. На экран не надо ничего выводить.

int sum(int a, int b)
{
    return a + b;
}

*/

/*
Функция sum 2
Написать функцию sum, которая принимает три вещественных числа, первые два параметра передаются по значению, а третий по ссылке.
Записать в третью переменную сумму первых двух. На экран ничего выводить не надо.

Пример работы:
Переменные: a = 1.1, b = 2, c
Вывоз функций: sum(a, b, c)
Значения после вызова: a = 1.1, b = 2, c = 3.1
*/
void sum(double a, double b, double &c)
{
    c = a + b;
}