// факториал
/*Напишите функцию factorial, которая принимает целое число и возвращает факториал числа.
Факториал n определяется как произведение всех чисел от 1 до n включительно.
Например, факториал 5 это 120, так как 1 * 2 * 3 * 4 * 5 = 120.*/

int factorial(int n)
{
    if (n < 0)
    {
        return -1; // Факториал не определен для отрицательных чисел
    }
    if (n == 0 || n == 1)
    {
        return 1; // Факториал 0 и 1 равен 1
    }
    int result = 1;
    for (int i = 2; i <= n; ++i)
    {
        result *= i;
    }
    return result;
}