/*
Фибоначчи
Напишите функцию fib, которая принимает целое число и возвращает n-ное число Фибоначчи.
Фибоначчи это последовательность чисел, где каждое число это сумма двух предыдущих.


#include <iostream>
using namespace std;

int fib(int n)
{
    if (n == 0)
    {
        return 0; // базовый случай: первое число Фибоначчи равно 0
    }
    else if (n == 1)
    {
        return 1; // базовый случай: второе число Фибоначчи равно 1
    }
    else
    {
        return fib(n - 1) + fib(n - 2); // рекурсивный вызов
    }
}


*/
/*
Сумма рекурсивно
Напишите рекурсивную функцию sum, которая принимает целое число n и возвращает сумму всех чисел от 1 до n включительно.
*/

#include <iostream>
using namespace std;

int sum(int n)
{
    if (n == 0)
    {
        return 0; // база, сумма чисел от 1 до 0 равна 0
    }
    else
    {
        return n + sum(n - 1); // рекурсивный вызов
    }
}
