// Дана сторона квадрата, нужно найти периметр. Формула: P = 4 * a; где a это сторона квадрата.
// Периметр квадрата - это сумма длин всех его сторон. Поскольку квадрат имеет четыре равные стороны, периметр можно найти, умножив длину одной стороны на 4. В данном случае, если сторона квадрата обозначается как 'a', то формула для периметра будет: P = 4 * a. Это означает, что если вы знаете длину одной стороны квадрата, вы можете легко вычислить его периметр, умножив эту длину на 4.

#include <iostream>
using namespace std;

void perimeter()
{
    int a;
    cin >> a;
    cout << 4 * a << endl;
}