//day2, ex2

#include <format>
#include <iostream>

using std::format;
using std::cout;

int main() {
    int array[] { 1, 2, 3, 4, 5 }; //2.у нас есть мыссив с пятью элементами
    int i {0}; // 3. создаем небольшую переменную индекса, которую будем использовать для индексации массива и я инициализирую это значение в ноль.

    while (i < 5) { //1. базовый цикл  while, а блок операторов находится в 14 и 15 строке. Условие называется управлением циклом, оно контролирует выполнение цикла.
        cout << format("element {} is {}\n", i, array[i]); //4. затем, внутри блока моего цикла я вывожу значение каждого элемента и увелечиваю индексную переменную i, используя инкремент ++i;
        ++i;
    }
}


//если я захотел бы остановить цикл в какой-то момент, я бы мог сделать такую вещь:
//написал бы if (i==3) break; сразу после 13 строки. В этого оператора if есть только один оператор и ему не нужны фигурные скобки. Вообщем, когда доходит цикл до индекса 3, цикл останавливается.

