/*Вопрос 1
Для Вас уже определен тип класса под названием "Pair". Вам нужно написать функцию pairFactory, которая создает экземпляр Pair на куче. Не создавайте объект на стеке. Затем Ваша функция должна вернуть указатель на этот созданный объект.

Советы:

- Под "экземпляром" типа класса подразумевается одна переменная, созданная с помощью этого типа. Мы говорим так, чтобы четко разграничить сам тип класса и конкретные переменные, которые имеют этот тип класса. Например, если Вы объявляете "Pair p;", то p - это экземпляр Pair. Также принято говорить, что экземпляр класса - это "объект".

- Если Вы застряли, пожалуйста, ознакомьтесь: Как Вы создаете переменную на стеке? Как создать переменную на куче?

- Если Вы видите серверное сообщение "InfraError", это означает, что Ваша программа завершилась с ошибкой сегментации, как правило. В этом случае, скорее всего, Вы вернули недопустимый адрес. Убедитесь, что Вы создаете Пару на куче.

- Указатели - это переменные, которые хранят адреса памяти в качестве своего фактического значения. Считается, что указатель "указывает" на то, что расположено по адресу, который он хранит. Возврат указателя означает возврат копии самого указателя, т.е. адреса, который хранит указатель, а не копии того, на что он указывает.

- Конечно, переменные-указатели также располагаются по адресам в памяти, но адрес, по которому находится указатель, отличается от адреса, который он содержит в качестве своего значения.
*/




#include <iostream>


class Pair {
public:
  int first, second;
  void check() {
    first = 5;
    std::cout << "Congratulations! The check() method of the Pair class \n has executed. (But, this isn't enough to guarantee \n that your code is correct.)" << std::endl;
  }
};



Pair* pairFactory() {
Pair* newPair = new Pair;

  return new Pair;
}




int main() {
  Pair *p;
  p = pairFactory();

  p->check();

  delete p;

  std::cout << "If you can see this text, the system hasn't crashed yet!" << std::endl;

  return 0;
}
