#include <iostream>

int main ()

{

    //есть 3 переменные и 3 указателя на них
    int i = 2, j = 4, k = 8;
    int *p = &i, *q = &j, *r = &k;

    k = i; //копирую значение из i в k. Теперь k равно 2.
    std::cout << i << j << k << *p << *q << *r << std::endl;


    p = q; //Мы копируем адрес. Теперь p больше не смотрит на i. Он смотрит туда же, куда и q — на переменную j.
    std::cout << i << j << k << *p << *q << *r << std::endl;

    *q = *r; //число по адресу r (там лежит 2) и запишим его по адресу q
    std::cout << i << j << k << *p << *q << *r << std::endl;

    return 0;
}
