
#include <iostream>

int main () {

int a = 5;
int b = 5;


if (a>b)

{ std:: cout << "a больше b" << std :: endl;
}

else if (a<b)
{ std::cout << "a меньше b" << std:: endl; 

}

else 
{std::cout<< "a == b" << std::endl;}


    return 0;
}






/*
Задание 3 — сравнение двух чисел

Условие:
Есть два целых числа a и b.

Программа должна вывести:
"a больше b" — если a > b
"a меньше b" — если a < b
"a равно b" — если a == b

Требования (важно)
использовать if / else if / else
никаких циклов
никаких тернарных операторов
только логика и условия

Подсказка (одна, и достаточно)
Сравнение всегда взаимно исключающее, значит:

либо больше
либо меньше
либо равно

 if → else if → else.
*/