#include <iostream>

int main() {



int age = 16;

if ( age>=18) 
{
    std :: cout << " Взрослый" << std :: endl;
}

else if (age>=13 && age <=17) 
{
    std :: cout << " Подросток" << std :: endl;
}

else
{
    std :: cout << " Ребёнок" << std :: endl;
}




    return 0;
} 




/*
Задание 2

Сделать программу для проверки возраста:

если возраст ≥ 18 → «Взрослый»

если возраст 13–17 → «Подросток»

иначе → «Ребёнок»

 Цель: потренироваться с диапазонами и логикой.

*/