#include <iostream>

int main() {



int a = 0;

if ( a>0) 
{
    std :: cout << " Положительное." << std :: endl;
}

else if (a<0) 
{
    std :: cout << " Отрицательное." << std :: endl;
}

else
{
    std :: cout << " Ноль" << std :: endl;
}




    return 0;
} 




/*

Задание 1

Напиcал программу, которая проверяет число a:

если a положительное → «Положительное»

если a ноль → «Ноль»

если a отрицательное → «Отрицательное»

 Цель: потренироваться  if, else if, else.

*/