/* Задание 2 — while + счётчик

Условие:
создать int i = 1
пока i <= 5
выводить i
увеличивать i

*/

#include <iostream>

int main () {

int i = 1;
while (i<=5)
{
    std:: cout << i << std::endl;
    i++;
}



    return 0;
}